{
    "common": {
        "name": "mielecloudservice",
        "version": "4.0.4",
        "news": {
            "4.0.4": {
                "en": "Bugfix Release - see changelog for details!",
                "de": "Bugfix Release - Details siehe Changelog!",
                "ru": "Выпуск исправления ошибок - подробности см. В журнале изменений!",
                "pt": "Versão de correção de bug - veja o changelog para detalhes!",
                "nl": "Bugfix Release - zie changelog voor details!",
                "fr": "Bugfix Release - voir le journal des modifications pour plus de détails!",
                "it": "Bugfix Release - vedi changelog per i dettagli!",
                "es": "Versión de corrección de errores: consulte el registro de cambios para obtener más detalles.",
                "pl": "Wydanie poprawek - szczegóły w dzienniku zmian!",
                "zh-cn": "错误修正版本-有关详细信息，请参见更改日志！"
            },
            "4.0.0": {
                "en": "Major Release - Update with care and read the change log!",
                "de": "Hauptversion - Aktualisieren Sie sorgfältig und lesen Sie das Änderungsprotokoll!",
                "ru": "Основной выпуск - обновляйте внимательно и читайте журнал изменений!",
                "pt": "Versão principal - atualize com cuidado e leia o log de alterações!",
                "nl": "Grote release - Update zorgvuldig en lees het wijzigingslogboek!",
                "fr": "Version majeure - Mettez à jour avec soin et lisez le journal des modifications!",
                "it": "Versione principale: aggiorna con attenzione e leggi il registro delle modifiche!",
                "es": "Versión principal: actualice con cuidado y lea el registro de cambios.",
                "pl": "Główne wydanie - aktualizuj uważnie i przeczytaj dziennik zmian!",
                "zh-cn": "主要版本-谨慎更新并阅读更改日志！"
            },
            "3.0.2": {
                "en": "Maintenance release - Bugfixes and minor improvements.",
                "de": "Wartungsversion - Bugfixes und kleinere Verbesserungen.",
                "ru": "Технический релиз - исправления и мелкие улучшения.",
                "pt": "Versão de manutenção - correções de bugs e pequenas melhorias.",
                "nl": "Onderhoudsrelease - Bugfixes en kleine verbeteringen.",
                "fr": "Version de maintenance - Corrections de bogues et améliorations mineures.",
                "it": "Versione di manutenzione: correzioni di bug e miglioramenti minori.",
                "es": "Versión de mantenimiento: correcciones de errores y mejoras menores.",
                "pl": "Wydanie konserwacyjne - poprawki błędów i drobne ulepszenia.",
                "zh-cn": "维护版本-错误修正和较小的改进。"
            },
            "3.0.1": {
                "en": "Maintenance release - Bugfixes and minor improvements.",
                "de": "Wartungsversion - Bugfixes und kleinere Verbesserungen.",
                "ru": "Технический релиз - исправления и мелкие улучшения.",
                "pt": "Versão de manutenção - correções de bugs e pequenas melhorias.",
                "nl": "Onderhoudsrelease - Bugfixes en kleine verbeteringen.",
                "fr": "Version de maintenance - Corrections de bogues et améliorations mineures.",
                "it": "Versione di manutenzione: correzioni di bug e miglioramenti minori.",
                "es": "Versión de mantenimiento: correcciones de errores y mejoras menores.",
                "pl": "Wydanie konserwacyjne - poprawki błędów i drobne ulepszenia.",
                "zh-cn": "维护版本-错误修正和较小的改进。"
            },
            "3.0.0": {
                "en": "BREAKING CHANGE Release see changelog for all changes.",
                "de": "BREAKING CHANGE Release Alle Änderungen finden Sie im Changelog.",
                "ru": "BREAKING CHANGE Release см. В журнале изменений все изменения.",
                "pt": "QUEBRANDO MUDANÇAS Release veja o changelog para todas as mudanças.",
                "nl": "BREAKING CHANGE Release zie het changelog voor alle wijzigingen.",
                "fr": "BREAKING CHANGE Relâchez voir changelog pour tous les changements.",
                "it": "CAMBIAMENTI ROTTURANTI Rilasciare vedere il log delle modifiche per tutte le modifiche.",
                "es": "CAMBIO IMPORTANTE Lanzamiento ver registro de cambios para todos los cambios.",
                "pl": "NIESAMOWITA ZMIANA Wydanie Zobacz listę zmian dla wszystkich zmian.",
                "zh-cn": "BREAKING CHANGE发布，请参阅更改日志以了解所有更改。"
            },
            "2.0.3": {
                "en": "Added debug code and fixed some minor bugs.",
                "de": "Debug-Code hinzugefügt und einige kleinere Fehler behoben.",
                "ru": "Добавлен код отладки и исправлены мелкие ошибки.",
                "pt": "Adicionado código de depuração e corrigidos alguns pequenos bugs.",
                "nl": "Foutopsporingscode toegevoegd en enkele kleine bugs verholpen.",
                "fr": "Ajout du code de débogage et correction de quelques bugs mineurs.",
                "it": "Aggiunto codice di debug e risolti alcuni bug minori.",
                "es": "Se agregó código de depuración y se corrigieron algunos errores menores.",
                "pl": "Dodano kod debugowania i naprawiono kilka drobnych błędów.",
                "zh-cn": "添加了调试代码并修复了一些小错误。"
            },
            "2.0.0": {
                "en": "Support for Miele API V1.0.3 - Update with care due to breaking changes - Read Changelog!",
                "de": "Unterstützung für Miele API V1.0.3 - Mit Vorsicht aktualisieren aufgrund wesentlicher Änderungen - Lies das Changelog!",
                "ru": "Поддержка Miele API V1.0.3 - Обновление с осторожностью из-за критических изменений - Прочтите журнал изменений!",
                "pt": "Suporte para Miele API V1.0.3 - Atualize com cuidado devido a alterações importantes - Leia o registro de alterações!",
                "nl": "Ondersteuning voor Miele API V1.0.3 - Update met zorg vanwege het breken van wijzigingen - Lees Changelog!",
                "fr": "Prise en charge de l'API Miele V1.0.3 - Mise à jour avec précaution en raison de modifications importantes - Lisez le journal des modifications!",
                "it": "Supporto per Miele API V1.0.3 - Aggiorna con cura a causa di modifiche di rilievo - Leggi il log delle modifiche!",
                "es": "Soporte para Miele API V1.0.3 - Actualice con cuidado debido a cambios importantes - ¡Lea el registro de cambios!",
                "pl": "Wsparcie dla Miele API V1.0.3 - Aktualizuj ostrożnie ze względu na istotne zmiany - Przeczytaj Changelog!",
                "zh-cn": "支持Miele API V1.0.3-重大更改请谨慎更新-阅读Changelog！"
            },
            "1.2.4": {
                "en": "Fixed No-Data-Bug which was introduced in V1.2.3",
                "de": "No-Data-Bug behoben, der in V1.2.3 eingeführt wurde",
                "ru": "Исправлена ​​ошибка No-Data-Bug, которая была представлена ​​в V1.2.3",
                "pt": "Corrigido o erro sem dados, que foi introduzido na V1.2.3",
                "nl": "Fixed No-Data-Bug die werd geïntroduceerd in V1.2.3",
                "fr": "Correction de No-Data-Bug qui a été introduit dans V1.2.3",
                "it": "Fixato No-Data-Bug che fu introdotto in V1.2.3",
                "es": "Se corrigió el error Sin datos que se introdujo en V1.2.3",
                "pl": "Naprawiono błąd braku danych, który został wprowadzony w wersji 1.2.3",
                "zh-cn": "修复了V1.2.3中引入的No-Data-Bug"
            },
            "1.2.2": {
                "en": "Improved error handling, ",
                "de": "Verbesserte Fehlerbehandlung,",
                "ru": "Улучшена обработка ошибок,",
                "pt": "Manipulação de erro aprimorada,",
                "nl": "Verbeterde foutafhandeling,",
                "fr": "Amélioration de la gestion des erreurs,",
                "it": "Gestione degli errori migliorata,",
                "es": "Manejo mejorado de errores,",
                "pl": "Poprawiona obsługa błędów,",
                "zh-cn": "改进的错误处理，"
            },
            "1.2.1": {
                "en": "New: SignalActionRequired, Updated Documentation on github, Fixes for js-Controller 3",
                "de": "Neu: SignalActionRequired, Aktualisierte Dokumentation auf Github, Korrekturen für js-Controller 3",
                "ru": "Новое: SignalActionRequired, обновленная документация по github, исправления для js-Controller 3",
                "pt": "Novo: SignalActionRequired, documentação atualizada no github, correções para js-Controller 3",
                "nl": "Nieuw: SignalActionRequired, bijgewerkte documentatie op github, fixes voor js-Controller 3",
                "fr": "Nouveau: SignalActionRequired, documentation mise à jour sur github, correctifs pour js-Controller 3",
                "it": "Novità: SignalActionRequired, documentazione aggiornata su github, correzioni per js-Controller 3",
                "es": "Nuevo: SignalActionRequired, documentación actualizada en github, correcciones para js-Controller 3",
                "pl": "Nowość: SignalActionRequired, zaktualizowana dokumentacja github, poprawki dla js-Controller 3",
                "zh-cn": "新增内容：SignalActionRequired，github上更新的文档，js-Controller 3的修复"
            },
            "1.2.0": {
                "en": "Switched to AXIOS http-client and added two new (redundant) states (connected and signalInUse) for convenience purposes in VIS.",
                "de": "Zu AXIOS http-client gewechselt und zwei neue (redundante) Zustände (verbunden und signalInUse) hinzugefügt, um die Arbeit in VIS zu vereinfachen.",
                "ru": "Переключился на http-client AXIOS и добавил два новых (избыточных) состояния (подключен и signalInUse) для удобства в VIS.",
                "pt": "Alternou para o AXIOS http-client e adicionou dois novos estados (redundantes) (conectado e signalInUse) para fins de conveniência no VIS.",
                "nl": "Overgeschakeld naar AXIOS http-client en twee nieuwe (redundante) statussen (verbonden en signalInUse) toegevoegd voor het gemak in VIS.",
                "fr": "Passé à AXIOS http-client et ajouté deux nouveaux états (redondants) (connectés et signalInUse) à des fins de commodité dans VIS.",
                "it": "Passato a AXIOS http-client e aggiunto due nuovi stati (ridondanti) (connesso e signalInUse) per motivi di praticità in VIS.",
                "es": "Cambió a AXIOS http-client y agregó dos nuevos estados (redundantes) (conectado y signalInUse) para fines de conveniencia en VIS.",
                "pl": "Przełączono na http-client AXIOS i dodano dwa nowe (redundantne) stany (podłączony i signalInUse) dla wygody w VIS.",
                "zh-cn": "切换到AXIOS http-client并添加了两个新的（冗余）状态（connected和signalInUse），以便在VIS中使用。"
            }
        },
        "title": "Miele CloudService",
        "titleLang": {
            "en": "Miele CloudService",
            "de": "Miele CloudService",
            "ru": "Miele CloudService",
            "pt": "Miele CloudService",
            "nl": "Miele CloudService",
            "fr": "Miele CloudService",
            "it": "Miele CloudService",
            "es": "Miele CloudService",
            "pl": "Miele CloudService",
            "zh-cn": "Miele CloudService"
        },
        "desc": {
            "en": "Miele CloudService: Get your Miele appliances (WiFiConn@ct & XGW 3000) connected to ioBroker.",
            "de": "Miele CloudService: Verbinden Sie Ihre Miele-Geräte (WiFiConn@ct & XGW 3000) mit ioBroker.",
            "ru": "Miele CloudService: подключите свои устройства Miele (WiFiConn@ct & XGW 3000) к ioBroker.",
            "pt": "Miele CloudService: conecte seus dispositivos Miele (WiFiConn@ct & XGW 3000) ao ioBroker.",
            "nl": "Miele CloudService: verbind uw Miele-apparaten (WiFiConn@ct & XGW 3000) met ioBroker.",
            "fr": "Miele CloudService: connectez vos appareils Miele (WiFiConn@ct & XGW 3000) à ioBroker.",
            "it": "Miele CloudService: collega i tuoi apparecchi Miele (WiFiConn@ct & XGW 3000) a ioBroker.",
            "es": "Miele CloudService: conecte sus dispositivos Miele (WiFiConn@ct & XGW 3000) a ioBroker.",
            "pl": "Miele CloudService: Połącz swoje urządzenia Miele (WiFiConn@ct & XGW 3000) z ioBroker.",
            "zh-cn": "Miele CloudService：将Miele (WiFiConn@ct & XGW 3000)设备连接到ioBroker。"
        },
        "authors": [
            "grizzelbee <open.source@hingsen.de>"
        ],
        "platform": "Javascript/Node.js",
        "mode": "daemon",
        "compact": true,
        "icon": "mielecloudservice.svg",
        "extIcon": "https://github.com/Grizzelbee/ioBroker.mielecloudservice/blob/master/admin/mielecloudservice.svg",
        "materialize": true,
        "enabled": true,
        "keywords": [
            "MieleCloudService"
        ],
        "readme": "https://github.com/Grizzelbee/ioBroker.mielecloudservice/blob/master/README.md",
        "loglevel": "info",
        "type": "household",
        "connectionType": "cloud",
        "dataSource": "poll",
        "dependencies": [
            {
                "js-controller": ">=3.0.0",
                "admin": ">=4.0.9"
            }
        ],
        "license": "MIT",
        "messagebox": true,
        "subscribe": "messagebox"
    },
    "native": {
        "Client_secret": "",
        "Miele_pwd": "",
        "Miele_account": "",
        "Client_ID": "",
        "locale": "de",
        "oauth2_vg": "de-DE",
        "pollinterval": 1,
        "pollUnit": 60
    },
    "encryptedNative": [
        "Client_secret",
        "Miele_pwd"
    ],
    "protectedNative": [
        "Client_secret",
        "Miele_pwd"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to miele cloud service",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}