{
    "common": {
        "name": "mielecloudservice",
        "version": "5.0.0",
        "news": {
            "5.0.0": {
                "en": "BREAKING CHANGE: removed grouping folders\nSwitched from data polling to server sent events and implemented changes for API 1.0.5\nMany fixes - see changelog for details",
                "de": "BREAKING CHANGE: Gruppierungsordner entfernt\nUmgestellt von Datenabfrage auf vom Server gesendete Ereignisse und Änderungen für API 1.0.5 implementiert\nViele Fixes – siehe Änderungsprotokoll für Details",
                "ru": "ПРЕРЫВАНИЕ ИЗМЕНЕНИЙ: удалены группирующие папки. \n Переключен с опроса данных на отправленные сервером события и внесены изменения в API 1.0.5.",
                "pt": "QUEBRANDO A MUDANÇA: pastas de agrupamento removidas \n Mudou de polling de dados para eventos enviados pelo servidor e implementou mudanças para API 1.0.5 \n Muitas correções - veja changelog para detalhes",
                "nl": "BREKENDE WIJZIGING: verwijderde groeperingsmappen\n Overgeschakeld van data polling naar door de server verzonden gebeurtenissen en wijzigingen doorgevoerd voor API 1.0.5\nVeel fixes - zie changelog voor details",
                "fr": "BREAKING CHANGE : suppression des dossiers de regroupement",
                "it": "CAMBIAMENTO D'INTERRUZIONE: cartelle di raggruppamento rimosse\nPassato dal polling dei dati agli eventi inviati dal server e modifiche implementate per l'API 1.0.5\nMolte correzioni: vedere il registro delle modifiche per i dettagli",
                "es": "CAMBIO IMPORTANTE: carpetas de agrupación eliminadas \n Cambio de sondeo de datos a eventos enviados por el servidor e implementado cambios para API 1.0.5 \n Muchas correcciones: consulte el registro de cambios para obtener más detalles",
                "pl": "NAJWAŻNIEJSZA ZMIANA: usunięto foldery grupujące \n Przejście z odpytywania danych na serwer wysłanych zdarzeń i zaimplementowanych zmian dla API 1.0.5 \n Wiele poprawek - zobacz dziennik zmian po szczegóły",
                "zh-cn": "突破性变化：删除分组文件夹\n从数据轮询切换到服务器发送的事件并实施了 API 1.0.5 的更改\n许多修复 - 请参阅更改日志以获取详细信息"
            },
            "4.2.0": {
                "en": "Adding Pause action to dish washers",
                "de": "Hinzufügen der Pause-Aktion zu Geschirrspülern",
                "ru": "Добавление действия паузы в посудомоечные машины",
                "pt": "Adicionar ação de pausa às máquinas de lavar louça",
                "nl": "Een pauze-actie toevoegen aan vaatwassers",
                "fr": "Ajout d'une action Pause aux lave-vaisselle",
                "it": "Aggiunta dell'azione Pausa alle lavastoviglie",
                "es": "Adición de la acción de pausa a los lavavajillas",
                "pl": "Dodanie akcji Pauza do zmywarek",
                "zh-cn": "为洗碗机增加暂停功能"
            },
            "4.1.0": {
                "en": "Adding support for Miele RX2 vacuum cleaner robots (Start, Stop, Pause).",
                "de": "Unterstützung für Miele RX2-Staubsaugerroboter hinzugefügt (Start, Stopp, Pause).",
                "ru": "Добавлена ​​поддержка роботов-пылесосов Miele RX2 (Start, Stop, Pause).",
                "pt": "Adicionando suporte para robôs de aspirador de pó Miele RX2 (Iniciar, Parar, Pausar).",
                "nl": "Ondersteuning toevoegen voor Miele RX2-stofzuigerrobots (Start, Stop, Pause).",
                "fr": "Ajout de la prise en charge des robots aspirateurs Miele RX2 (Start, Stop, Pause).",
                "it": "Aggiunta del supporto per i robot aspirapolvere Miele RX2 (Start, Stop, Pause).",
                "es": "Adición de soporte para robots aspiradores Miele RX2 (Inicio, Detención, Pausa).",
                "pl": "Dodanie obsługi robotów odkurzających Miele RX2 (Start, Stop, Pauza).",
                "zh-cn": "增加了对Miele RX2吸尘器机器人的支持（启动，停止，暂停）。"
            },
            "4.0.22": {
                "en": "Bugfix Release - see full changelog since your last version for details!",
                "de": "Bugfix Release - Bitte sehen Sie sich das vollständige Änderungsprotokoll seit Ihrer aktuell eingesetzten Version an!",
                "ru": "Выпуск Bugfix - подробности смотрите в полном журнале изменений с момента выхода последней версии!",
                "pt": "Versão de correção de bug - veja o changelog completo desde sua última versão para detalhes!",
                "nl": "Bugfix Release - zie het volledige log met wijzigingen sinds uw laatste versie voor details!",
                "fr": "Bugfix Release - voir le journal des modifications complet depuis votre dernière version pour plus de détails!",
                "it": "Rilascio bugfix: guarda il log delle modifiche completo dall'ultima versione per i dettagli!",
                "es": "Versión de corrección de errores: consulte el registro de cambios completo desde su última versión para obtener más detalles.",
                "pl": "Wydanie poprawek - zobacz pełną listę zmian od ostatniej wersji, aby uzyskać szczegółowe informacje!",
                "zh-cn": "错误修正版本-自上一版本以来，查看完整的变更日志以获取详细信息！"
            },
            "4.0.0": {
                "en": "Major Release - Update with care and read the change log!",
                "de": "Hauptversion - Aktualisieren Sie sorgfältig und lesen Sie das Änderungsprotokoll!",
                "ru": "Основной выпуск - обновляйте внимательно и читайте журнал изменений!",
                "pt": "Versão principal - atualize com cuidado e leia o log de alterações!",
                "nl": "Grote release - Update zorgvuldig en lees het wijzigingslogboek!",
                "fr": "Version majeure - Mettez à jour avec soin et lisez le journal des modifications!",
                "it": "Versione principale: aggiorna con attenzione e leggi il registro delle modifiche!",
                "es": "Versión principal: actualice con cuidado y lea el registro de cambios.",
                "pl": "Główne wydanie - aktualizuj uważnie i przeczytaj dziennik zmian!",
                "zh-cn": "主要版本-谨慎更新并阅读更改日志！"
            },
            "3.0.2": {
                "en": "Maintenance release - Bugfixes and minor improvements.",
                "de": "Wartungsversion - Bugfixes und kleinere Verbesserungen.",
                "ru": "Технический релиз - исправления и мелкие улучшения.",
                "pt": "Versão de manutenção - correções de bugs e pequenas melhorias.",
                "nl": "Onderhoudsrelease - Bugfixes en kleine verbeteringen.",
                "fr": "Version de maintenance - Corrections de bogues et améliorations mineures.",
                "it": "Versione di manutenzione: correzioni di bug e miglioramenti minori.",
                "es": "Versión de mantenimiento: correcciones de errores y mejoras menores.",
                "pl": "Wydanie konserwacyjne - poprawki błędów i drobne ulepszenia.",
                "zh-cn": "维护版本-错误修正和较小的改进。"
            },
            "3.0.1": {
                "en": "Maintenance release - Bugfixes and minor improvements.",
                "de": "Wartungsversion - Bugfixes und kleinere Verbesserungen.",
                "ru": "Технический релиз - исправления и мелкие улучшения.",
                "pt": "Versão de manutenção - correções de bugs e pequenas melhorias.",
                "nl": "Onderhoudsrelease - Bugfixes en kleine verbeteringen.",
                "fr": "Version de maintenance - Corrections de bogues et améliorations mineures.",
                "it": "Versione di manutenzione: correzioni di bug e miglioramenti minori.",
                "es": "Versión de mantenimiento: correcciones de errores y mejoras menores.",
                "pl": "Wydanie konserwacyjne - poprawki błędów i drobne ulepszenia.",
                "zh-cn": "维护版本-错误修正和较小的改进。"
            },
            "3.0.0": {
                "en": "BREAKING CHANGE Release see changelog for all changes.",
                "de": "BREAKING CHANGE Release Alle Änderungen finden Sie im Changelog.",
                "ru": "BREAKING CHANGE Release см. В журнале изменений все изменения.",
                "pt": "QUEBRANDO MUDANÇAS Release veja o changelog para todas as mudanças.",
                "nl": "BREAKING CHANGE Release zie het changelog voor alle wijzigingen.",
                "fr": "BREAKING CHANGE Relâchez voir changelog pour tous les changements.",
                "it": "CAMBIAMENTI ROTTURANTI Rilasciare vedere il log delle modifiche per tutte le modifiche.",
                "es": "CAMBIO IMPORTANTE Lanzamiento ver registro de cambios para todos los cambios.",
                "pl": "NIESAMOWITA ZMIANA Wydanie Zobacz listę zmian dla wszystkich zmian.",
                "zh-cn": "BREAKING CHANGE发布，请参阅更改日志以了解所有更改。"
            },
            "2.0.3": {
                "en": "Added debug code and fixed some minor bugs.",
                "de": "Debug-Code hinzugefügt und einige kleinere Fehler behoben.",
                "ru": "Добавлен код отладки и исправлены мелкие ошибки.",
                "pt": "Adicionado código de depuração e corrigidos alguns pequenos bugs.",
                "nl": "Foutopsporingscode toegevoegd en enkele kleine bugs verholpen.",
                "fr": "Ajout du code de débogage et correction de quelques bugs mineurs.",
                "it": "Aggiunto codice di debug e risolti alcuni bug minori.",
                "es": "Se agregó código de depuración y se corrigieron algunos errores menores.",
                "pl": "Dodano kod debugowania i naprawiono kilka drobnych błędów.",
                "zh-cn": "添加了调试代码并修复了一些小错误。"
            }
        },
        "title": "Miele CloudService",
        "titleLang": {
            "en": "Miele CloudService",
            "de": "Miele CloudService",
            "ru": "Miele CloudService",
            "pt": "Miele CloudService",
            "nl": "Miele CloudService",
            "fr": "Miele CloudService",
            "it": "Miele CloudService",
            "es": "Miele CloudService",
            "pl": "Miele CloudService",
            "zh-cn": "Miele CloudService"
        },
        "desc": {
            "en": "Miele CloudService: Get your Miele appliances (WiFiConn@ct & XGW 3000) connected to ioBroker.",
            "de": "Miele CloudService: Verbinden Sie Ihre Miele-Geräte (WiFiConn@ct & XGW 3000) mit ioBroker.",
            "ru": "Miele CloudService: подключите свои устройства Miele (WiFiConn@ct & XGW 3000) к ioBroker.",
            "pt": "Miele CloudService: conecte seus dispositivos Miele (WiFiConn@ct & XGW 3000) ao ioBroker.",
            "nl": "Miele CloudService: verbind uw Miele-apparaten (WiFiConn@ct & XGW 3000) met ioBroker.",
            "fr": "Miele CloudService: connectez vos appareils Miele (WiFiConn@ct & XGW 3000) à ioBroker.",
            "it": "Miele CloudService: collega i tuoi apparecchi Miele (WiFiConn@ct & XGW 3000) a ioBroker.",
            "es": "Miele CloudService: conecte sus dispositivos Miele (WiFiConn@ct & XGW 3000) a ioBroker.",
            "pl": "Miele CloudService: Połącz swoje urządzenia Miele (WiFiConn@ct & XGW 3000) z ioBroker.",
            "zh-cn": "Miele CloudService：将Miele (WiFiConn@ct & XGW 3000)设备连接到ioBroker。"
        },
        "authors": [
            "grizzelbee <open.source@hingsen.de>"
        ],
        "platform": "Javascript/Node.js",
        "mode": "daemon",
        "compact": true,
        "icon": "mielecloudservice.svg",
        "extIcon": "https://github.com/Grizzelbee/ioBroker.mielecloudservice/blob/master/admin/mielecloudservice.svg",
        "adminUI": {
            "config": "materialize"
        },
        "enabled": true,
        "keywords": [
            "MieleCloudService"
        ],
        "readme": "https://github.com/Grizzelbee/ioBroker.mielecloudservice/blob/master/README.md",
        "loglevel": "info",
        "type": "household",
        "connectionType": "cloud",
        "dataSource": "push",
        "dependencies": [
            {
                "js-controller": ">=3.0.0",
                "admin": ">=4.0.9"
            }
        ],
        "license": "MIT",
        "tier": 2,
        "materialize": true,
        "messagebox": true,
        "subscribe": "messagebox",
        "plugins": {
            "sentry": {
                "dsn": "https://bb362bebab074bcd8b8f821a070f6662@o505019.ingest.sentry.io/5735758"
            }
        }
    },
    "native": {
        "Client_secret": "",
        "Miele_pwd": "",
        "Miele_account": "",
        "Client_ID": "",
        "locale": "de",
        "oauth2_vg": "de-DE",
        "pollinterval": 1,
        "pollUnit": 60
    },
    "encryptedNative": [
        "Client_secret",
        "Miele_pwd"
    ],
    "protectedNative": [
        "Client_secret",
        "Miele_pwd"
    ],
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "If connected to miele cloud service",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}